;; -*- coding: utf-8 -*-
#+TITLE: Capítulo 12 — Autocorrelación en Series de Tiempo
#+SUBTITLE: Gujarati (Econometría Básica) ✦ Wooldridge (Introducción a la Econometría) — Notas Comparativas
#+AUTHOR: Emanuel Quintana Silva · UPTC · Laboratorio de Datos
#+DATE: @@latex:\today@@
#+LANGUAGE: es
#+OPTIONS: toc:3 num:t H:4 ^:{} ':t
#+STARTUP: overview indent
#+PROPERTY: header-args:python :session econ-py :results output :exports both
#+PROPERTY: header-args:R      :session econ-R  :results output :exports both
#+PROPERTY: header-args:julia  :session econ-jl :results output :exports both
#+PROPERTY: header-args:rust   :results output  :exports both

#+BEGIN_QUOTE
/«La autocorrelación no es un pecado — es una señal. La pregunta real es: ¿señal de qué?»/
— adaptado de Gujarati & Porter, 5ª ed.
#+END_QUOTE

** Autocorrelacion y Correlacion serial

Autocorrelacion: "correlacion rezagada de una serie consigo misma, rezagada por un numero de unidades de tiempo"

#+BEGIN_SRC stata :results output
webuse air2, clear
describe
tsset t
regress air L.air
estat dwatson
predict u, residual
generate u_lag = u[_n-1]
correlate u u_lag
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_12814.log
  log type:  text
 opened on:   1 May 2026, 22:45:30

. webuse air2, clear
(TIMESLAB: Airline passengers)

. describe

Contains data from https://www.stata-press.com/data/r19/air2.dta
 Observations:           144                  TIMESLAB: Airline passengers
    Variables:             3                  3 Mar 2024 10:01
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
air             int     %8.0g                 Airline passengers (1949-1960)
time            float   %9.0g                 Time (in months)
t               int     %9.0g                 Time
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: t

. tsset t

Time variable: t, 1 to 144
        Delta: 1 unit

. regress air L.air

      Source |       SS           df       MS      Number of obs   =       143
-------------+----------------------------------   F(1, 141)       =   1666.08
       Model |  1871165.72         1  1871165.72   Prob > F        =    0.0000
    Residual |   158355.94       141  1123.09177   R-squared       =    0.9220
-------------+----------------------------------   Adj R-squared   =    0.9214
       Total |  2029521.66       142  14292.4061   Root MSE        =    33.513

           _coef_table():  3499  member _b_table::set_rowcformat() not found
--Break--
r(1);

end of do-file
--Break--
r(1);
#+end_example


#+BEGIN_SRC stata :results output
webuse air2, clear
generate lnair = ln(air)
tsset t
regress air lnair
predict u, residual
generate u_lag = u[_n-1]
scatter u u_lag, title("Residuales vs Residuales rezagados")
graph export "/home/emanuel/org/grafico_autocorr.png", replace
#+END_SRC

#+RESULTS:
#+begin_example
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\tmp\stata_out_14027.log
  log type:  text
 opened on:   1 May 2026, 22:50:00

. webuse air2, clear
(TIMESLAB: Airline passengers)

. generate lnair = ln(air)

. tsset t

Time variable: t, 1 to 144
        Delta: 1 unit

. regress air lnair

      Source |       SS           df       MS      Number of obs   =       144
-------------+----------------------------------   F(1, 142)       =   2821.37
       Model |  1959426.06         1  1959426.06   Prob > F        =    0.0000
    Residual |  98618.0988       142  694.493653   R-squared       =    0.9521
-------------+----------------------------------   Adj R-squared   =    0.9517
       Total |  2058044.16       143  14391.9172   Root MSE        =    26.353

------------------------------------------------------------------------------
         air | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lnair |   265.1603   4.992043    53.12   0.000      255.292    275.0287
       _cons |  -1189.267    27.7538   -42.85   0.000    -1244.131   -1134.403
------------------------------------------------------------------------------

. predict u, residual

. generate u_lag = u[_n-1]
(1 missing value generated)

. scatter u u_lag, title("Residuales vs Residuales rezagados")

. graph export "/home/emanuel/org/grafico_autocorr.png", replace
(file /home/emanuel/org/grafico_autocorr.png not found)
file /home/emanuel/org/grafico_autocorr.png saved as PNG format

. clear

. log close
      name:  <unnamed>
       log:  C:\tmp\stata_out_14027.log
  log type:  text
 closed on:   1 May 2026, 22:50:05
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#+end_example

- Correlacion Serial: Correlacion rezagada entre dos series diferentes
